                        // Удалить элементы с помощью splice()
// Итак, мы узнали, как удалять элементы из начала и конца массива с помощью shift()и pop(), но что, если мы хотим удалить элемент где-то в
//  середине? Или удалить более одного элемента одновременно? Что ж, вот где splice()в дело вступает.
//   splice()позволяет нам сделать именно это: удалить любое количество последовательных элементов из любого места в массиве.

// splice()может принимать до 3 параметров, но сейчас мы сосредоточимся только на первых двух. Первые два параметра являются целыми числами,
//  которые представляют индексы или позиции элементов в вызываемом splice()массиве . splice()И помните, массивы имеют нулевой индекс ,
//   поэтому для обозначения первого элемента массива мы будем использовать 0. splice()первый параметр представляет собой индекс массива,
//    с которого нужно начать удаление элементов, а второй параметр указывает количество удаляемых элементов. Например:



// let array = ['today', 'was', 'not', 'so', 'great'];

// array.splice(2, 2);
// Здесь мы удаляем 2 элемента, начиная с третьего элемента (по индексу 2). arrayбудет иметь значение ['today', 'was', 'great'].

// splice()не только изменяет массив, к которому он вызывается, но также возвращает новый массив, содержащий значение удаленных элементов:



// let array = ['I', 'am', 'feeling', 'really', 'happy'];

// let newArray = array.splice(3, 2);
// newArrayимеет значение ['really', 'happy'].


//task
// Мы инициализировали массив arr. Используйте splice()для удаления элементов из arr, чтобы он содержал только элементы
// сумма которых равна значению 10.
const arr = [2, 4, 5, 1, 7, 5, 2, 1];
// Only change code below this line
arr.shift()
arr.splice(3)
// Only change code above this line
console.log(arr);