                    // Скопируйте массив с помощью оператора Spread
// В то время как slice()позволяет нам выбирать, какие элементы массива копировать, помимо нескольких других полезных задач, 
// новый оператор распространения ES6 позволяет нам легко копировать все элементы массива по порядку с помощью простого и
// легко читаемого синтаксиса. Синтаксис распространения выглядит следующим образом:...

// На практике мы можем использовать оператор распространения для копирования массива следующим образом:

// let thisArray = [true, true, undefined, false, null];
// let thatArray = [...thisArray];
// thatArrayравно [true, true, undefined, false, null]. thisArrayостается неизменным и thatArrayсодержит те же элементы, что и thisArray.



//task
// Мы определили функцию, copyMachineкоторая принимает arr(массив) и num(число) в качестве аргументов. Предполагается,
//  что функция возвращает новый массив, состоящий из numкопий файлов arr. Мы сделали большую часть работы за вас,
//   но она пока не работает должным образом. Измените функцию, используя синтаксис расширения, чтобы она работала
//    правильно (подсказка: здесь может пригодиться другой метод, который мы уже рассмотрели!).
function copyMachine(arr, num) {
    let newArr = [];
    while (num >= 1) {
      // Only change code below this line
      newArr.push([...arr])
      // Only change code above this line
      num--;
    }
    return newArr;
  }
  
  console.log(copyMachine([true, false, true], 2));