// Изменить объект, вложенный в объект
// Теперь давайте взглянем на немного более сложный объект. Свойства объектов могут быть вложены на произвольную глубину, 
// а их значениями могут быть данные любого типа, поддерживаемые JavaScript, включая массивы и даже другие объекты. Рассмотрим следующее:

// let nestedObject = {
//   id: 28802695164,
//   date: 'December 31, 2016',
//   data: {
//     totalUsers: 99,
//     online: 80,
//     onlineStatus: {
//       active: 67,
//       away: 13,
//       busy: 8
//     }
//   }
// };
// nestedObjectимеет три свойства: id(значение — число), date(значение — строка) и data(значение — объект с его вложенной структурой).
//  Хотя структуры могут быстро усложняться, мы по-прежнему можем использовать одни и те же обозначения для доступа к необходимой нам информации. 
//  Чтобы присвоить значение 10свойству busyвложенного onlineStatusобъекта, мы используем запись через точку для ссылки на свойство:

// nestedObject.data.onlineStatus.busy = 10;
// Здесь мы определили объект userActivity, который включает в себя другой объект, вложенный в него. Установите значение onlineключа на 45.

