            // Понимание терминологии функционального программирования
// У команды FCC были перепады настроения, и теперь они хотят два вида чая: зеленый чай и черный чай.
//  Общий факт: перепады настроения у клиентов довольно распространены.

// С этой информацией нам нужно будет вернуться к getTeaфункции из последней задачи, чтобы обрабатывать различные запросы на чай.
//  Мы можем изменить getTea, чтобы принять функцию в качестве параметра, чтобы иметь возможность изменить тип чая, который она
//   готовит. Это делает его getTeaболее гибким и дает программисту больше контроля при изменении клиентских запросов.

// Но сначала давайте рассмотрим некоторую функциональную терминологию:

// Обратные вызовы — это функции, которые проскальзывают или передаются в другую функцию, чтобы определить вызов этой функции.
//  Возможно, вы видели, как они передаются другим методам, например filter, в функции обратного вызова сообщают JavaScript критерии
//   фильтрации массива.

// Функции, которые могут быть присвоены переменной, переданы в другую функцию или возвращены из другой функции, как и любое другое
//  нормальное значение, называются функциями первого класса . В JavaScript все функции являются функциями первого класса.

// Функции, которые принимают функцию в качестве аргумента или возвращают функцию в качестве возвращаемого значения, называются 
// функциями высшего порядка .

// Когда функции передаются в другую функцию или возвращаются из нее, то те функции, которые были переданы или возвращены,
//  можно назвать лямбдой .


//task
// Приготовьте 27 чашек зеленого чая и 13 чашек черного чая и сохраните их в переменных tea4GreenTeamFCCи tea4BlackTeamFCC
// соответственно. Обратите внимание, что getTeaфункция была изменена, поэтому теперь она принимает функцию в качестве первого 
// аргумента.

// Примечание. Данные (количество чашек чая) предоставляются в качестве последнего аргумента. Мы обсудим это подробнее в следующих 
// уроках.    

//soll
// Function that returns a string representing a cup of green tea
const prepareGreenTea = () => 'greenTea';

// Function that returns a string representing a cup of black tea
const prepareBlackTea = () => 'blackTea';

/*
Given a function (representing the tea type) and number of cups needed, the
following function returns an array of strings (each representing a cup of
a specific type of tea).
*/
const getTea = (prepareTea, numOfCups) => {
  const teaCups = [];

  for(let cups = 1; cups <= numOfCups; cups += 1) {
    const teaCup = prepareTea();
    teaCups.push(teaCup);
  }
  return teaCups;
};

// Only change code below this line
const tea4GreenTeamFCC = getTea(prepareGreenTea, 27);
const tea4BlackTeamFCC = getTea(prepareBlackTea, 13);
// Only change code above this line

console.log(
  tea4GreenTeamFCC,
  tea4BlackTeamFCC
);