        // Определите функцию-конструктор
// Конструкторы — это функции, которые создают новые объекты. Они определяют свойства и поведение,
//  которые будут принадлежать новому объекту. Думайте о них как о схеме создания новых объектов.

// Вот пример конструктора:

// function Bird() {
//   this.name = "Albert";
//   this.color = "blue";
//   this.numLegs = 2;
// }
// Этот конструктор определяет Birdобъект со свойствами name, colorи numLegsустановленными в Albert, blue и 2 соответственно.
//  Конструкторы следуют нескольким соглашениям:

// Конструкторы определяются с именами, написанными с заглавной буквы, чтобы отличать их от других функций,
//  не являющихся constructors.
// Конструкторы используют ключевое слово thisдля установки свойств объекта, который они будут создавать.
//  Внутри конструктора thisссылается на новый объект, который он создаст.
// Конструкторы определяют свойства и поведение вместо того, чтобы возвращать значение, как могли бы другие функции.


//task
// Создайте конструктор , Dog со свойствами name, color и , numLegs для которых заданы строка, строка и число соответственно.
function Dog() {
    this.name = 'Spike'
    this.color = 'white'
    this.numLegs = 4
  }